Repository: sicakbirtebessum/PlayerScope
Catalog: PlayerScope/Properties/Loc.*.resx
Languages: tr

# StUploadedCharacters
source: Uploaded Characters Count:
tr: Aktarilan Oyuncu Sayisi:

# StCharacterName
source: Character Name:
tr: Karakter Adi:

# StRoleDescriptionNonVerified
source: Ouch! Only "verified members" can send information and receive from the server.
tr: Tüh! Yalnizca "onayli kullanicilar" sunucuya bilgi gönderebilir ve sunucudan alabilir.

# StRole
source: Role:
tr: Rol:

# StRoleGuest
source: Guest
tr: Misafir

# StRoleVerifiedMember
source: Verified Member
tr: Onayli Üye

# StRoleBanned
source: Banned
tr: Yasakli

# StRoleMember
source: Member
tr: Üye

# StRoleOwner
source: Owner
tr: Kurucu

# StRoleMod
source: Moderator
tr: Moderatör

# StPermissions
source: - Permissions:
tr: - Izinler:

# StRoleAdmin
source: Admin
tr: Yönetici

# StSendAndReceiveData
source: (Send & Receive Data)
tr: (Veri Gönder ve Al)

# StAuthorizeDescription
source: As you are a verified user, you are authorized to send information and receive from the server.
tr: Dogrulanmis bir kullanici oldugun icin sunucuya veri gönderme ve sunucudan veri alma yetkin var.

# StShowMyIds
source: Show my ids
tr: Idlerimi göster

# StClickToCopyAccountId
source: Click to copy Account Id
tr: Kopyalamak için tikla

# StClickToCopyContentId
source: Click to copy Content Id
tr: Kopyalamak için tikla

# StMyContributions
source: My contributions ♥
tr: Katkilarim ♥

# StUploadedCharactersHint
source: The total count of characters you sent to the server who were not previously in the database.
tr: Daha önce veritabaninda bulunmayan ve sunucuya gönderdigin karakterlerin toplam sayisi.

# StUploadedCharacterInfoHint
source: The count of character info changes you sent to the server who are already in the database but have different names or worlds
tr: Veritabaninda halihazirda bulunan ancak farkli isimlere veya dünyalara sahip olan karakterlerin bilgi degisikliklerini sunucuya gönderdigin toplam sayi.

# StUploadedRetainersHint
source: The total count of retainers you sent to the server who were not previously in the database.
tr: Daha önce veritabaninda bulunmayan ve sunucuya gönderdigin retainerlarin toplam sayisi.

# StUploadedRetainers
source: Uploaded Retainers Count:
tr: Aktarilan Retainer Sayisi:

# StUploadedRetainerInfoHint
source: The total count of retainer info changes (name or world) you sent to the server.
tr: Sunucuya gönderdigin retainer bilgi degisikliklerinin (isim veya dünya) toplam sayisi.

# StFetchedCharactersHint
source: The total count of characters whose profile details you have viewed.
tr: Profil bilgilerini görüntüledigin karakterlerin toplam sayisi.

# StFetchedCharacter
source: Fetched Character Info Count:
tr: Getirilen Karakter Bilgisi Sayisi:

# StSearchedNamesHint
source: The total number of character and retainer search count.
tr: Karakter ve retainer arama sayisinin toplami.

# StSearchedNames
source: Total number of searched Character & Retainer names:
tr: Aratilan Karakter ve Retainer isimlerinin toplam sayisi:

# StRefreshProfileInfo
source: Refresh Profile Info
tr: Profil Bilgilerini Yenile

# StRefreshProfileInfoHint
source: Request profile data from the server
tr: Sunucudan profil verilerini getir

# StHomeWorld
source: Home World:
tr: Anadünya:

# StLoginWithDiscord
source: Login with Discord
tr: Discord ile Giris Yap

# StErrorLoginWithACharacter
source: You are not logged in. Please login with a character to continue.
tr: Henüz giris yapmadin. Devam etmek için lütfen bir karakterle giris yap.

# StServerDatabaseStats
source: Server Database Stats
tr: Sunucu Veritabani Istatistikleri

# StRefreshServerStats
source: Refresh Server Stats
tr: Sunucu Istatistiklerini Yenile

# StCharacterCount
source: Character Count:
tr: Karakter Sayisi:

# StPrivateCharacters
source: private characters
tr: gizli karakter

# StPrivateRetainers
source: private retainers
tr: gizli retainer

# StRetainerCount
source: Retainer Count:
tr: Retainer Sayisi:

# StRetainerCountColumn
source: Retainer Count
tr: Retainer Sayisi

# StUserCount
source: User Count:
tr: Kullanici Sayisi:

# StLastUpdatedOn
source: Last Updated on:
tr: Son güncelleme:

# StSyncCharacterAndRetainerFromServer
source: Sync Character and Retainer info from Server
tr: Karakter ve Retainer bilgilerini sunucudan senkronize et

# StSyncCharacterAndRetainerFromServerTooltip
source: In order to see the name of the owner of the Retainer while browsing items on the Marketboard, you'll need to download the player information from the server to your computer. If you're doing this for the first time, it may take approximately one minute.
tr: Marketboard’daki esyalari incelerken Retainer sahibinin ismini görebilmen için sunucudaki bilgilerin yerel bilgisayarina aktarilmasi gerekiyor. Bu islemi ilk kez yapiyorsan yaklasik 1 dakika sürebilir.

# ToolsYear
source: Year
tr: yil

# ToolsYears
source: Years
tr: yil

# ToolsAboutFromNow
source: about {0} {1} from now
tr: yaklasik {0} {1} icinde

# ToolsAboutSecondsFromNow
source: about {0} seconds from now
tr: yaklasik {0} saniye icinde

# ToolsJustNow
source: just now
tr: az önce

# ToolsMinutes
source: minutes
tr: dakika

# ToolsMinute
source: minute
tr: dakika

# ToolsHour
source: hour
tr: saat

# ToolsHours
source: hours
tr: saat

# ToolsDay
source: day
tr: gün

# ToolsDays
source: days
tr: gün

# ToolsMonth
source: month
tr: ay

# ToolsMonths
source: months
tr: ay

# ToolsTimeSinceAgo
source: {0} {1} ago
tr: {0} {1} önce

# ToolsTimeSinceMinutesAgo
source: {0} {1} {2} minutes ago
tr: {0} {1} {2} dakika önce

# ToolsSecond
source: second
tr: saniye

# ToolsSeconds
source: seconds
tr: saniye

# ToolsTimeSinceSecondsAgo
source: {0} {1} {2} seconds ago
tr: {0} {1} {2} saniye önce

# StCanSyncAgainTime
source: Can resynchronize in:
tr: Yeniden senkronize et:

# StStopFetching
source: Stop Fetching
tr: Veri Çekmeyi Durdur

# StConfigurePrivacyOfChars
source: You can configure the privacy settings of your characters in this tab.
tr: Bu sekmede karakterlerinin gizlilik ayarlarini degistirebilirsin.

# StThisTabDisplaysLodestoneProfiles
source: This tab displays the Lodestone profiles you have claimed. All characters associated with these profiles will automatically appear in the My Characters tab.
tr: Bu sekme, sahiplendigin Lodestone profillerini gösterir. Bu profillerle iliskili tüm karakterler otomatik olarak 'Karakterlerim' sekmesinde görünecektir.

# StATotalOfCharsFound
source: A total of {0} characters of yours were found.
tr: Sana ait olan toplamda {0} karakter bulundu.

# StATotalOfLodestoneProfiles
source: There are {0} Lodestone profiles that you have claimed.
tr: Sahiplendigin {0} Lodestone profili mevcut.

# LsPasteTheCodeIntoYourBio
source: Paste the code below into your Lodestone biography to verify your account. Then, click the 'Verify' button below.
tr: Profilini dogrulamak için asagidaki kodu Lodestone biyografine yapistir. Ardindan asagidaki 'Dogrula' butonuna tikla.

# StUploadedCharacterInfo
source: Uploaded Character Info Count:
tr: Aktarilan Oyuncu Bilgisi Sayisi:

# StUploadedRetainerInfo
source: Uploaded Retainer Info Count:
tr: Aktarilan Retainer Bilgisi Sayisi:

# StNameNotFound
source: [NAME NOT FOUND]
tr: [ISIM BULUNAMADI]

# StTotalVisitCount
source: Total Visit Count:
tr: Toplam Görüntülenme Sayisi:

# StSomeoneVisitedYourProfile
source: Your character's profile was last visited on:
tr: Karakterinin profili en son su tarihte görüntülendi:

# StPrivacyHideFullProfile
source: Hide Full Profile
tr: Tamamen Gizle

# StPrivacyHideFullProfileTooltip
source: Other players will NOT be able to see your profile. However, if they have seen you before, they can find you by searching in the Local PC section.
tr: Diger oyuncular profilini GÖREMEYECEK. Ancak, seni daha önce görmüslerse, Yerel PC bölümünde arama yaparak seni bulabilirler.

# StPrivacyHideLocationHistory
source: Hide Location History
tr: Konum Geçmisini Gizle

# StPrivacyHideLocationHistoryTooltip
source: Other players will NOT be able to see your location history.
tr: Diger oyuncular konum geçmisini GÖREMEYECEK.

# StPrivacyHideCustomizationHistory
source: Hide Customization History
tr: Özellestirme Geçmisini Gizle

# StPrivacyDontAppearInSearchResults
source: Dont Appear in Search Results
tr: Arama Sonuçlarinda Gösterme

# StPrivacyHideAltCharacters
source: Hide Alt Characters
tr: Yan Karakterleri Gizle

# StPrivacyHideRetainers
source: Hide Retainers
tr: Retainerlari Gizle

# StPrivacyHideRetainersTooltip
source: None of your retainers will be visible to other players and will NOT appear in search results.
tr: Retainerlarin diger oyunculara görünmeyecek ve arama sonuçlarinda yer almayacak.

# StPrivacyHideAltCharactersTooltip
source: None of your alt characters will be visible to other players in the detailed player window.
tr: Yan karakterlerin detayli oyuncu penceresinde diger oyunculara görünmeyecek.

# StPrivacyDontAppearInSearchResultsTooltip
source: Your name will NOT appear in search results.
tr: Ismin arama sonuçlarinda GÖRÜNMEYECEK.

# StPrivacyHideCustomizationHistoryTooltip
source: Other players will NOT be able to see your customization history.
tr: Diger oyuncular özellestirme geçmisini GÖREMEYECEK.

# StSaveConfig
source: Save Config
tr: Ayarlari Kaydet

# StConfigSaved
source: Config saved
tr: Ayarlar kaydedildi

# StSaveConfigTooltip
source: Save your configuration to server.
tr: Ayarlari sunucuya kaydet.

# StFetchingCharacters
source: Fetching Characters...
tr: Karakterler getiriliyor...

# StFetchingRetainers
source: Fetching Retainers...
tr: Retainerlar getiriliyor...

# StErrorStoppedFetching
source: Error: Stopped fetching.
tr: Hata: Veri çekme durduruldu.

# StErrorUnableToFetchCharacters
source: Error: Unable to fetch Characters.
tr: Hata: Karakterler getirilemiyor.

# StErrorUnableToFetchRetainers
source: Error: Unable to fetch Retainers.
tr: Hata: Retainerlar çekilemiyor.

# StFetchingComplete
source: Fetching Complete.
tr: Veri Alma Tamamlandi.

# StSavingToLocalDb
source: Saving to the local database. This may take a moment...
tr: Yerel veritabanina kaydediliyor. Bu islem biraz sürebilir...

# StErrorWhileSavingToLocalDb
source: An error occurred while saving the data. Please try again.
tr: Veri kaydedilirken bir hata olustu. Lütfen tekrar deneyin.

# StCharacters
source: Characters
tr: Karakterler

# StRetainers
source: Retainers
tr: Retainerlar:

# StServerIp
source: Server Ip
tr: Sunucu Adresi

# StConnect
source: Connect
tr: Baglan

# StCheckServerStatus
source: Check Server Status
tr: Sunucuyu Kontrol Et

# StCheckingStatus
source: Checking Status...
tr: Kontrol Ediliyor...

# StServerStatus
source: Server Status:
tr: Sunucu Durumu:

# StOnline
source: ONLINE
tr: ÇEVRIMIÇI

# StTabUserInfo
source: User Info
tr: Kullanici Bilgisi

# StTabServerStatsAndSync
source: Server Stats & Sync
tr: Sunucu Istatistikleri ve Senkronizasyon

# StTabMyCharactersAndPrivacy
source: My Characters & Privacy
tr: Karakterlerim ve Gizlilik

# StTabClaimedLodestoneProfiles
source: Claimed Lodestone Profiles
tr: Sahiplenilen Lodestone Profilleri

# StTabMyCharacters
source: My Characters
tr: Karakterlerim

# MnName
source: Name
tr: Isim

# MnNameComboBox
source: Name
tr: Ismi

# MnAccountCount
source: AccCount
tr: HspSayisi

# MnRetainerCount
source: RetainerCount
tr: RetainerSayisi

# MnRetainers
source: Retainers
tr: Retainerlar

# MnRetainerStatistics
source: Retainer Statistics
tr: Retainer Istatistikleri

# MnDatabaseInformation
source: Database Information
tr: Veritabani Bilgileri

# MnDatabaseDetails
source: Database Details
tr: Veritabani Detaylari

# MnDatabaseLegacyDetails
source: Legacy Database Details
tr: Eski Veritabani Detaylari

# MnDatabasePendingDeletion
source: It will be deleted on your next restart
tr: Bir sonraki yeniden baslatmada silinecek

# MnDatabaseDeleteData
source: Delete All Local Database Data
tr: Tüm Yerel Veritabani Kayitlarini Sil

# MnDatabaseLegacyDeleteData
source: Delete Legacy Database Folder
tr: Eski Yerel Veritabani Klasörünü Sil

# MnDatabaseDeleteDataTooltip
source: Deletes all data in the local database. Hold down the CTRL+Shift keys to enable clicking.
tr: Yerel veritabanindaki tüm kayitlari siler. Tiklayabilmek için CTRL+Shift tuslarina basili tut.

# MnDatabaseSuccessfullyDeletedNotification
source: All data have been successfully deleted.
tr: Tüm kayitlar basariyla silindi.

# MnDatabaseFilePathCopied
source: Database file path copied
tr: Veritabani dosya yolu kopyalandi

# MnDatabaseCopyFilePath
source: Copy database file path
tr: Veritabani dosya yolunu kopyala

# MnDatabaseOpenFolder
source: Open Folder
tr: Klasörü Aç

# MnDatabaseSize
source: Database size:
tr: Veritabani boyutu:

# MnDatabaseLogSize
source: Database log size:
tr: Veritabani log boyutu:

# MnAccountId
source: Account Id
tr: Hesap Id

# MnWorld
source: World
tr: Dünya

# MnAddedAt
source: Added at
tr: Eklendi

# MnOwnerContentId
source: OwnerContentId
tr: SahipContentId

# MnTotalRetainers
source: Total Retainers
tr: Toplam Retainer

# MnTotalCharacters
source: Total Characters
tr: Toplam Karakter

# MnTabLocalStats
source: Local Stats
tr: Yerel Istatistikler

# MnTabServerStats
source: Server Stats
tr: Sunucu Istatistikleri

# MnTabSearchCharacterAndRetainer
source: Search Characters & Retainers
tr: Karakter veya Retainer Ara

# MnTabMyFavorites
source: My Favorites
tr: Favorilerim

# MnServer
source: Server
tr: Sunucu

# MnLocalPC
source: Local PC
tr: Yerel PC

# MnCharacter
source: Character
tr: Karakter

# MnByName
source: By Name
tr: Isim ile

# MnById
source: By Id
tr: Id ile

# MnSource
source: Source
tr: Kaynak

# MnTextInputEnterHere
source: Enter {0}'s {1} here
tr: {0}in {1}ni gir

# MnSearching
source: Searching...
tr: Araniyor...

# MnSearch
source: Search
tr: Ara

# MnErrorBadSearchQuery
source: Error: Bad search query
tr: Hata: Geçersiz arama sorgusu

# MnErrorBadSearchQueryAtLeastLetters
source: Error: At least 2 letters!
tr: Hata: En az 2 harf!

# MnErrorYouAreNotConnected
source: Error: You are not connected to server.
tr: Hata: Sunucuya bagli degilsin.

# MnOpenSettingsMenutoconnect
source: Open Settings Menu to connect to Server
tr: Sunucuya baglanmak için Ayarlar Menüsünü aç

# MnYouAreConnected
source: You're connected to the server. You can synchronize player and retainer information.
tr: Sunucuya baglisin. Oyuncu ve retainer bilgilerini senkronize edebilirsin.

# MnOpenSettingsMenu
source: Open Settings Menu
tr: Ayarlar Menüsünü Aç

# MnOpenMainMenu
source: Open Main Menu
tr: Ana Menüyü Aç

# MnRemove
source: Remove
tr: Sil

# TitleMainMenu
source: PlayerScope Main Menu
tr: PlayerScope Ana Menü

# TitleDetailsMenu
source: PlayerScope Details Menu
tr: PlayerScope Detay Menüsü

# TitleSettingsMenu
source: PlayerScope Server Settings
tr: PlayerScope Sunucu Ayarlari

# StLanguage
source: Lang:
tr: Dil:

# ApiTotalFound
source: Total Found:
tr: Toplam Sonuç:

# ApiError
source: Error:
tr: Hata:

# ApiProfileRefreshed
source: Profile refreshed.
tr: Profil yenilendi.

# ApiStatsRefreshed
source: Stats refreshed.
tr: Istatistikler yenilendi.

# ApiServiceUnavailable
source: Service Unavailable
tr: Hizmet Kullanilamiyor

# DtRetainerName
source: Retainer Name
tr: Retainer Adi

# DtOwnerName
source: Owner Name
tr: Sahibin Adi

# StCancelLogin
source: X Cancel
tr: X Iptal Et

# AgCrowsourcedDescription
source: • This plugin operates on a crowdsourced model, meaning it relies on contributions from the player community to function and improve. Every player using the plugin contributes data, which helps build a more comprehensive and accurate dataset for everyone.
tr: • Bu plugin, topluluk katkili bir modelde çalismaktadir; bu da oyuncu toplulugunun katkilarina dayanarak islevini sürdürüp gelistigi anlamina gelir. Plugini kullanan her oyuncu veri katkisinda bulunur ve bu da herkes için daha kapsamli ve dogru bir veri seti olusturulmasina yardimci olur.

# AgServerBasedFeatures
source: Server-Based Features:
tr: Sunucu Tabanli Özellikler:

# AgFeature1
source: Automatic Alt Account Detection: The plugin automatically detects and links alt accounts of uploaded characters.
tr: Otomatik Alt Hesap Algilama: Plugin, aktarilan karakterlerin alt hesaplarini otomatik olarak algilar ve birbirine baglar.

# AgFeature2
source: Character Name and HomeWorld History: Keeps a record of all the names a character has previously used and the world transfers they have made.
tr: Karakter Isim ve Anadünya Geçmisi: Bir karakterin daha önce kullandigi tüm isimler ve yaptigi dünya transferlerinin kaydini tutar.

# AgFeature3
source: Retainer History & Marketboard UI: Records all changes made to a character's retainers, links the retainer with its owner and displays the owner's name when browsing the market board.
tr: Retainer Geçmisi ve Marketboard Arayüzü: Bir karakterin retainerlarina yapilan tüm degisiklikleri kaydeder, retainer'i sahibiyle eslestirir ve marketboard'da gezindiginizde sahibinin ismini gösterir.

# AgFeature4
source: Location History: Records the last known location of a character and keeps a history of the maps they’ve visited.
tr: Konum Geçmisi: Bir karakterin en son bilinen konumunu kaydeder ve ziyaret ettigi haritalarin geçmisini tutar.

# AgFeature5
source: Customization History: Records all changes to a character's customizations.
tr: Özellestirme Geçmisi: Bir karakterin özellestirmelerindeki tüm degisiklikleri kaydeder.

# AgFeature6
source: It also shows the date when all this information was added to the server.
tr: Ayrica, bu bilgilerin sunucuya eklendigi tarihi de gösterir.

# AgAgreementTitle
source: Plugin Consent - Upon connecting to the server, you consent to the following conditions:
tr: Plugin Riza Metni - Sunucuya baglandiginizda, asagidaki kosullari kabul etmis olursunuz:

# AgAgreement1
source: The information of characters nearby, characters on the player search window and the retainers you browse on the marketboard will be uploaded to the server.
tr: Yakininizdaki karakterler, oyuncu arama penceresindeki karakterler ve marketboard'da incelediginiz retainer'larin bilgileri sunucuya yüklenecektir.

# AgAgreement2
source: This information may include a wide range of details, such as character IDs, character customizations, character locations and retainer informations.
tr: Bu bilgiler, karakter Idleri, karakter özellestirmeleri, karakter konumlari ve retainer bilgileri gibi çesitli ayrintilari içerebilir.

# AgAgreement3
source: Just as you can see the data uploaded by other users, the data you upload will also be visible to other users.
tr: Diger kullanicilar tarafindan yüklenen verileri görebildiginiz gibi, siz tarafindan yüklenen veriler de diger kullanicilar tarafindan görülebilecektir.

# AgAgreement4
source: However, you can change the visibility of your characters in the privacy settings under the My 'Characters & Privacy' tab, allowing you to hide the details of your characters from other users.
tr: Ancak, 'Karakterlerim ve Gizlilik' sekmesindeki gizlilik ayarlarindan karakterlerinizin görünürlügünü degistirebilir ve karakterlerinizin detaylarini diger kullanicilardan gizleyebilirsiniz.

# AgDoYouAccept
source: Do you accept the terms of the plugin?
tr: Plugin'in kosullarini kabul ediyor musunuz?

# AgIAgreeCheckBox
source: I agree that the information of characters around me, the characters on the player search menu and the retainers I see while browsing the marketboard will be uploaded to the server.
tr: Etrafimdaki karakterlerin, oyuncu arama menüsündeki karakterlerin ve marketboard'a göz atarken gördügüm retainer'larin bilgilerinin sunucuya aktarilmasini kabul ediyorum.

# DtLastSeenZoneName
source: Last Seen Zone Name
tr: Son Görüldügü Bölge Adi

# DtCharacterName
source: Character Name
tr: Karakter Adi

# DtLastSeen
source: Last Seen
tr: Son Görülme

# DtFirstSeen
source: First Seen
tr: Ilk Görülme

# DtDuration
source: Duration
tr: Toplam Süre

# DtRaceInfo
source: Gender - Race
tr: Cinsiyet - Irk

# DtHeight
source: Height
tr: Boy

# DtMuscleMass
source: MuscleMass
tr: KasKütlesi

# DtBustSize
source: BustSize
tr: GögüsÖlçüsü

# DtAddToFavorites
source: Add to Favorites
tr: Favorilere Ekle

# DtRemoveFromFavorites
source: Remove from Favorites
tr: Favorilerden Kaldir

# DtShowTheDateDetail
source: Show the date in detail
tr: Tarihi ayrintili göster

# DtRefreshProfile
source: Refresh Profile
tr: Profili Yenile

# DtLoading
source: Loading...
tr: Yükleniyor...

# DtFetchDetailedCharacterInfo
source: Fetch Detailed Character Info From Server
tr: Sunucudan Ayrintili Oyuncu Bilgilerini Getir

# DtCharactersOfThePlayer
source: Characters of the player:
tr: Oyuncunun Karakterleri:

# DtRetainersOfThePlayer
source: All retainers of the player:
tr: Oyuncunun tüm retainerlari:

# DtPlayerInfo
source: Player Info
tr: Oyuncu Bilgisi

# DtLocationHistory
source: Location History
tr: Konum Geçmisi

# DtCustomizationHistory
source: Customization History
tr: Özellestirme Geçmisi

# DtShowingResultsFor
source: Showing results for:
tr: Sonuçlari gösterilen Id:

# DtCharacterLastSeenIn
source: Character last seen in:
tr: Karakter en son surada görüldü:

# DtNameHistory
source: Name History:
tr: Isim Geçmisi:

# DtHomeworldHistory
source: HomeWorld History:
tr: Anadünya Geçmisi:

# DtAltCharacters
source: Alt Characters
tr: Yan Karakterler

# DtShowRetainers
source: Show Retainers
tr: Retainerlari Göster

# DtShowAltCharacters
source: Show Alt Characters
tr: Alt Hesaplari Göster

# DtRetainerInfo
source: Info->
tr: Bilgi->

# DtLocationHistoryResultsAreDisplayed
source: A total of {0} location history results are displayed.
tr: Toplamda {0} konum geçmisi sonucu görüntüleniyor.

# DtMapButton
source: Map
tr: Harita

# MnFilterMatchAnyPartOfName
source: Match Any Part of Name
tr: Isimde Herhangi Bir Kismi Eslestir

# MnPlayerIdentifiedAsBot
source: This player is identified as a bot.
tr: Bu oyuncu bir bot olarak tanimlandi.

# MnPlayerIdentifiedAsGM
source: This player is identified as an official Game Master.
tr: Bu oyuncu resmi bir Game Master olarak tanimlandi.

# MnHomeWorldColumn
source: Home World
tr: Anadünya

# CmOpenUI
source: Open UI
tr: Arayüzü Göster

# StDidntTheBrowserOpen
source: Didn't the browser open?
tr: Tarayicin açilmadi mi?

# StCopyTheLink
source: Copy the link
tr: Linki kopyala

# UtilsCopyText
source: Copy text
tr: Metni kopyala

# StPasteItInBrowser
source: and paste it into your browser.
tr: ve tarayici adres çubuguna yapistir.

# StLinkCopied
source: Link copied.
tr: Link kopyalandi.

# DtPlayerFlagsBotMessage
source: This player is identified as a bot.
tr: Bu oyuncu bir bot olarak tanimlandi.

# DtPlayerFlagsGMMessage
source: This player is a Game Master.
tr: Bu oyuncu bir GM.

# DtPlayerFlagsSelfPrivateMessage
source: This profile is private, but you can view it as it belongs to you.
tr: Bu profil gizlidir ancak sana ait oldugu için görüntüleyebilirsin.

# DtPlayerFlagsPrivateMessage
source: This profile is private.
tr: Bu profil gizlidir.

# StThisCharacterIsPrivate
source: This character's profile is private.
tr: Bu karakterin profili gizlidir.

# StSomeDetailsThisCharacterAreHidden
source: Some details of this character's profile are hidden.
tr: Bu karakterin profilinin bazi ayrintilari gizlidir.

# StSomeDetailsCharacterArePrivate
source: This character's profile has some hidden details.
tr: Bu karakterin profilinin bazı ayrintilari gizlidir.

# DtCharacterVisitInfo
source: Total visits: {1} from {2} unique users. [Last visit: {0}]
tr: Toplam {1} kez, {2} farkli üye tarafindan ziyaret edildi. [Son ziyaret: {0}]

# MnOpenAdventurerPlate
source: Open Adventurer Plate
tr: Adventurer Plate'i Aç

# StHomeWorldName
source: Home World Name
tr: Anadünya Ismi

# WsWorldName
source: World Name
tr: Dünya Ismi

# WsSelect
source: Select
tr: Seç

# StCharacterCountColumn
source: Character Count
tr: Karakter Sayisi
