Repository: sicakbirtebessum/PlayerScope
Catalog: PlayerScope/Properties/Loc.*.resx
Languages: tr

# StRefreshDatabaseWorldCount
source: Refresh World Count Stats
tr: Sunucu Dünya Istatistiklerini Yenile

# UtilsJP
source: Japan
tr: Japonya

# UtilsNA
source: North America
tr: Kuzey Amerika

# UtilsEU
source: Europe
tr: Avrupa

# UtilsOCE
source: Oceania
tr: Okyanusya

# StCharacterAndRetainerSummary
source: Character and Retainer Summary
tr: Karakter ve Retainer Dagilimi

# StGeneralStats
source: General Stats
tr: Genel Istatistikler

# StOptions
source: Options
tr: Ayarlar

# StCharacterAndRetainerWorldCountMsg
source: The information here is based on the last recorded Home World of Characters and Retainers. Any Character without a Home World record will not affect these numbers.
tr: Buradaki bilgiler, Karakterlerin ve Retainerlarin en son kaydedilen Anadünya kaydina dayanmaktadir. Anadünya kaydi olmayan hiçbir Karakter bu sayilara etki etmeyecek.

# StTotalCount
source: Total Count
tr: Toplam Sayi

# StPrivacySetAllPrivate
source: Set all my characters to private
tr: Tüm karakterlerimi gizle hale getir

# StPrivacySetAllPublic
source: Set all my characters to public
tr: Tüm karakterlerimi herkese açik yap

# DtDatabaseRecordAddedTimeUnavailable
source: This record was retrieved from a different database, and the exact addition date is not clearly determined.
tr: Bu kayit, farkli bir veritabanindan alindi ve asil eklenme tarihi tam olarak belirli degil.

# TitleWorldSelectorWindow
source: World Selector
tr: Dünya Seçici

# MnSearchByWorld
source: Search by World
tr: Dünyaya Göre Ara

# MnSelectedWorlds
source: Selected Worlds:
tr: Seçilen Dünyalar:

# WsClearAll
source: Clear All
tr: Hepsini Temizle

# MnDatabaseStats
source: Database Stats
tr: Veritabani Istatistigi

# WsCloseWindow
source: Close Window
tr: Pencereyi Kapat

# MnFilters
source: Filters
tr: Filtreler

# TerritoryIntendedUseEnum.RaidFights
source: Raid Fights
tr: Raid Savaslari

# TerritoryIntendedUseEnum.Town
source: Town
tr: Kasaba

# TerritoryIntendedUseEnum.MaskedCarnival
source: Masked Carnival
tr: Maskeli Karnaval

# TerritoryIntendedUseEnum.OceanFishing
source: Ocean Fishing
tr: Okyanus Balikçiligi

# TerritoryIntendedUseEnum.OpenWorld
source: Open World
tr: Açik Dünya

# TerritoryIntendedUseEnum.Inn
source: Inn
tr: Han

# TerritoryIntendedUseEnum.Dungeon
source: Dungeon
tr: Zindan

# TerritoryIntendedUseEnum.JailArea
source: Jail Area
tr: Hapishane

# TerritoryIntendedUseEnum.OpeningArea
source: Opening Area
tr: Baslangiç Alani

# TerritoryIntendedUseEnum.FreeCompanyGarrison
source: Free Company Garrison
tr: Free Company Kalesi

# TerritoryIntendedUseEnum.PalaceOfTheDead
source: Palace of the Dead
tr: Ölüler Sarayi

# TerritoryIntendedUseEnum.TreasureMapInstance
source: Treasure Map Instance
tr: Hazine Haritasi Alani

# TerritoryIntendedUseEnum.Raids
source: Raids
tr: Baskinlar

# TerritoryIntendedUseEnum.ChocoboSquare
source: Chocobo Square
tr: Chocobo Meydanı

# TerritoryIntendedUseEnum.ChocoboTutorial
source: Chocobo Tutorial
tr: Chocobo Egitimi

# TerritoryIntendedUseEnum.Wedding
source: Wedding
tr: Dügün

# TerritoryIntendedUseEnum.PrivateEventArea
source: Private Event Area
tr: Özel Etkinlik Alani

# TerritoryIntendedUseEnum.TheFeastCrystalTower
source: The Feast Crystal Tower
tr: The Feast Kristal Kulesi

# TerritoryIntendedUseEnum.BeginnerTutorial
source: Beginner Tutorial
tr: Baslangiç Egitimi

# TerritoryIntendedUseEnum.MainStoryQuestEventArea
source: MSQ Event Area
tr: Ana Hikaye Görevi Etkinlik Alani

# TerritoryIntendedUseEnum.BeforeTrialDung
source: Pre Trial Dungeon
tr: Ön-Deneme Zindani

# TerritoryIntendedUseEnum.AllianceRaid
source: Alliance Raid
tr: Ittifak Baskini

# TerritoryIntendedUseEnum.OpenWorldInstanceBattle
source: Open World Instance Battle
tr: Açik Dünya Savas Alani

# TerritoryIntendedUseEnum.EventTrial
source: Event Trial
tr: Trial Etkinligi

# TerritoryIntendedUseEnum.TheFeastArea
source: The Feast Area
tr: The Feast Alani

# TerritoryIntendedUseEnum.RaidPublicArea
source: Raid Public Area
tr: Raid Genel Alani

# TerritoryIntendedUseEnum.HousingArea
source: HousingArea
tr: Konut Alani

# TerritoryIntendedUseEnum.HousingPrivateArea
source: Housing Private Area
tr: Konut Özel Alani

# TerritoryIntendedUseEnum.MainStoryQuestPrivateArea
source: MSQ Private Area
tr: Ana Hikaye Görevi Özel Alani

# UtilRegion
source: Region
tr: Bölge

# StClaimNewProfile
source: Claim Your Lodestone Profile
tr: Lodestone Profilini Sahiplen

# TitleClaimLodestoneWindow
source: PlayerScope Lodestone Verification
tr: PlayerScope Lodestone Dogrulama

# LsColumnNameAndHomeWorld
source: Name and HomeWorld
tr: Isim ve Anadünya

# LsColumnVerificationStatus
source: Verification Status
tr: Dogrulama Durumu

# LsEnterYourLodestoneLink
source: Enter your Lodestone profile link:
tr: Lodestone profil baglantini yaz:

# LsLodestoneProfileLink
source: Lodestone Profile Link
tr: Lodestone Profil Baglantisi

# LsNext
source: Next
tr: Devam et

# LsCopyTheCode
source: Copy the Code
tr: Kodu Kopyala

# LsCodeCopied
source: Code copied
tr: Kod kopyalandi

# LsOpenBiographySettings
source: Open Biography Settings
tr: Biyografi Ayarlarini Aç

# LsValidate
source: Validate
tr: Dogrula

# LsGoToMyCharactersMenu
source: Go to 'My Characters' menu
tr: 'Karakterlerim' menüsüne git

# StLodestoneVerifiedAt
source: Verified At
tr: Dogrulanma Tarihi

# LsVerifyDifferentProfile
source: Verify a Different Profile
tr: Farkli Bir Hesap Dogrula

# UtilClickToViewFullImage
source: Click to view the image in full size
tr: Resmi tam boyutta görmek için tikla

# UtilClickToCloseTheImage
source: Click to close the big image
tr: Büyük resmi kapatmak için tikla

# AvatarOpenOnBrowser
source: Open on Browser
tr: Tarayicida Aç

# AvatarResetSize
source: Reset Size
tr: Boyutu Sifirla

# AvatarResetZoom
source: Reset Zoom
tr: Yakinlastirmayi Sifirla

# DtOpenRightArrow
source: Open
tr: Git

# MnAreYouSure
source: Are you sure?
tr: Emin misin?

# MnYes
source: Yes
tr: Evet

# MnNo
source: No
tr: Hayir

# MnSaveNote
source: Save Note
tr: Notu Kaydet

# MnAddNote
source: Add Note
tr: Not Ekle

# DtCharacterCreationDate
source: Creation Date
tr: Olusturulma Zamani

# StSettingsHideCharacterAvatars
source: Hide Character Avatars
tr: Karakter Avatarlarini Gizle
